content/posts/note-taking.md
+++
title = "Note-taking"
date = 2021-06-11T14:12:00+08:00
lastmod = 2021-07-17T21:51:39+08:00
draft = false
+++

## Bullet Journal {#bullet-journal}

> A bullet journal is a method of personal organization developed by designer
> Ryder Carroll. The system organizes scheduling, reminders, to-do lists,
> brainstorming, and other organizational tasks into a single notebook.<br />

-> <https://bulletjournal.com>


## Org-mode {#org-mode}


## Org-roam {#org-roam}

> Org-roam is a tool for network thought. It reproduces some of Roam Research's
> features within the all-powerful Org-mode.
>
> Org-roam is a solution for effortless non-hierarchical note-taking with
> Org-mode. With Org-roam, notes flow naturally, making note-taking fun and
> easy. Org-roam keeps closely to Org syntax, and will work for anyone already
> using Org-mode for their personal wiki.

-> <https://www.orgroam.com/manual.html>

Read more,

-   [Use Org-roam to manage project in an effective way]({{< relref "org-roam-and-project" >}})
-   [Zettelkasten Note-taking Method]({{< relref "zettelkasten" >}})


## Read More {#read-more}

-   [How to Take Smart Notes?](https://haikebang.org/t/topic/82)


## Discuss Community {#discuss-community}

-   <https://haikebang.org/c/note-taking/>
